Revit 2024 API
BuiltInFailures.GeneralFailures.FailedToOpenFile Property
 Failed to open file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailedToOpenFile { get; }
Visual Basic
Public Shared ReadOnly Property FailedToOpenFile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailedToOpenFile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace